% 此程序用于计算系泊系统中锚链水平面夹角theta和浮标吃水深度h1的关系

% R 风力
% theta 锚链与水平面的夹角
% F_f 浮标的浮力
% h1 浮标吃水深度
% h2 浮标水面上高度
% h1 + h2 = 2;

;

m_b = 100; % 钢桶的质量
m_f = 1000; % 浮标的质量
m_t = 10; % 钢管质量

w = 7; % 锚链单位长度质量
L_sum = 22.05; % 锚链长度
m_c = w * L_sum; % 锚链质量

rho = 1.025e+3; % 海水的密度
g = 9.80665; % 地球标准重力加速度

V_b = pi * 0.15^2; % 钢桶体积

% i = 1;
% 
% for theta = 0 : 0.001 : pi/2
% 
h2 = (rho*g*pi*(0.15^2+2)-(m_b+m_f+m_t+m_r+m_c)*g)...
    /(1.25*v^2*tan(theta)+rho*g*pi);

h1 = 2 - h2;
% i = i + 1;
% end
% 
% theta = 0 : 0.001 : pi/2;
% plot(theta, h1, 'r');
% xlabel('锚链与海床水平夹角\theta/rad');
% ylabel('浮标吃水深度/m');